apache/nuttx/arch/arm/src/lpc313x/lpc313x_cgu.h
/************************************************************************************************
 * arch/arm/src/lpc313x/lpc313x_cgu.h
 *
 *   Copyright (C) 2009-2010 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <spudmonkey@racsa.co.cr>
 *
 * References:
 *   - UM10314 LPC3130/31 User manual Rev. 1.01 — 9 September 2009
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC313X_CGU_H
#define __ARCH_ARM_SRC_LPC313X_CGU_H

/************************************************************************************************
 * Included Files
 ************************************************************************************************/

#include <nuttx/config.h>
#include "lpc313x_memorymap.h"

/************************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************************/

/* CGU register base address offset into the APB0 domain ****************************************/

/* APB0 offsets to Clock Switch Box (CSB) and CGU Configuration (CFG) register groups */

#define LPC313X_APB0_GCU_CSB_OFFSET      (LPC313X_APB0_GCU_OFFSET)
#define LPC313X_APB0_GCU_CFG_OFFSET      (LPC313X_APB0_GCU_OFFSET+0x0c00)

/* Virtual and physical base address of the CGU block and CSB and CFG register groups */

#define LPC313X_CGU_VBASE                (LPC313X_APB0_VADDR+LPC313X_APB0_CGU_OFFSET)
#define LPC313X_CGU_PBASE                (LPC313X_APB0_PADDR+LPC313X_APB0_CGU_OFFSET)

#define LPC313X_CGU_CSB_VBASE            (LPC313X_APB0_VADDR+LPC313X_APB0_GCU_CSB_OFFSET)
#define LPC313X_CGU_CSB_PBASE            (LPC313X_APB0_PADDR+LPC313X_APB0_GCU_CSB_OFFSET)

#define LPC313X_CGU_CFG_VBASE            (LPC313X_APB0_VADDR+LPC313X_APB0_GCU_CFG_OFFSET)
#define LPC313X_CGU_CFG_PBASE            (LPC313X_APB0_PADDR+LPC313X_APB0_GCU_CFG_OFFSET)

/* CGU register offsets *************************************************************************/
/* CGU clock switchbox register offsets (with respect to the CGU CSB register base) *************/
/* Switch configuration registers (SCR) for base clocks */

#define LPC313X_CGU_SCR_OFFSET(n)        (0x000+((n)<<2))
#define LPC313X_CGU_SCR0_OFFSET          0x000 /* SYS base */
#define LPC313X_CGU_SCR1_OFFSET          0x004 /* AHB0_APB0 base */
#define LPC313X_CGU_SCR2_OFFSET          0x008 /* AHB0_APB1 base */
#define LPC313X_CGU_SCR3_OFFSET          0x00c /* AHB0_APB2 base */
#define LPC313X_CGU_SCR4_OFFSET          0x010 /* AHB0_APB3 base */
#define LPC313X_CGU_SCR5_OFFSET          0x014 /* PCM base */
#define LPC313X_CGU_SCR6_OFFSET          0x018 /* UART base */
#define LPC313X_CGU_SCR7_OFFSET          0x01c /* CLK1024FS base */
#define LPC313X_CGU_SCR8_OFFSET          0x020 /* I2SRX_BCK0 base */
#define LPC313X_CGU_SCR9_OFFSET          0x024 /* I2SRX_BCK1 base */
#define LPC313X_CGU_SCR10_OFFSET         0x028 /* SPI_CLK base */
#define LPC313X_CGU_SCR11_OFFSET         0x02c /* SYSCLK_O base */

/* Frequency select (FS) registers 1 for base clocks */

#define LPC313X_CGU_FS1_OFFSET(n)        (0x030+((n)<<2))
#define LPC313X_CGU_FS1_0_OFFSET         0x030 /* SYS base */
#define LPC313X_CGU_FS1_1_OFFSET         0x034 /* AHB0_APB0 base */
#define LPC313X_CGU_FS1_2_OFFSET         0x038 /* AHB0_APB1 base */
#define LPC313X_CGU_FS1_3_OFFSET         0x03c /* AHB0_APB2 base */
#define LPC313X_CGU_FS1_4_OFFSET         0x040 /* AHB0_APB3 base */
#define LPC313X_CGU_FS1_5_OFFSET         0x044 /* PCM base */
#define LPC313X_CGU_FS1_6_OFFSET         0x048 /* UART base */
#define LPC313X_CGU_FS1_7_OFFSET         0x04c /* CLK1024FS base */
#define LPC313X_CGU_FS1_8_OFFSET         0x050 /* I2SRX_BCK0 base */
#define LPC313X_CGU_FS1_9_OFFSET         0x054 /* I2SRX_BCK1 base */
#define LPC313X_CGU_FS1_10_OFFSET        0x058 /* SPI_CLK base */
#define LPC313X_CGU_FS1_11_OFFSET        0x05c /* SYSCLK_O base */

/* Frequency select (FS) registers 2 for base clocks */

#define LPC313X_CGU_FS2_OFFSET(n)        (0x060+((n)<<2))
#define LPC313X_CGU_FS2_0_OFFSET         0x060 /* SYS base */
#define LPC313X_CGU_FS2_1_OFFSET         0x064 /* AHB0_APB0 base */
#define LPC313X_CGU_FS2_2_OFFSET         0x068 /* AHB0_APB1 base */
#define LPC313X_CGU_FS2_3_OFFSET         0x06c /* AHB0_APB2 base */
#define LPC313X_CGU_FS2_4_OFFSET         0x070 /* AHB0_APB3 base */
#define LPC313X_CGU_FS2_5_OFFSET         0x074 /* PCM base */
#define LPC313X_CGU_FS2_6_OFFSET         0x078 /* UART base */
#define LPC313X_CGU_FS2_7_OFFSET         0x07c /* CLK1024FS base */
#define LPC313X_CGU_FS2_8_OFFSET         0x080 /* I2SRX_BCK0 base */
#define LPC313X_CGU_FS2_9_OFFSET         0x084 /* I2SRX_BCK1 base */
#define LPC313X_CGU_FS2_10_OFFSET        0x088 /* SPI_CLK base */
#define LPC313X_CGU_FS2_11_OFFSET        0x08c /* SYSCLK_O base */

/* Switch status registers (SSR) for base clocks */

