apache/nuttx/arch/arm/src/lpc313x/lpc313x_cgu.h
#define LPC313X_CGU_SSR_OFFSET(n)        (0x090+((n)<<2))
#define LPC313X_CGU_SSR0_OFFSET          0x090 /* SYS base */
#define LPC313X_CGU_SSR1_OFFSET          0x094 /* AHB0_APB0 base */
#define LPC313X_CGU_SSR2_OFFSET          0x098 /* AHB0_APB1 base */
#define LPC313X_CGU_SSR3_OFFSET          0x09c /* AHB0_APB2 base */
#define LPC313X_CGU_SSR4_OFFSET          0x0a0 /* AHB0_APB3 base */
#define LPC313X_CGU_SSR5_OFFSET          0x0a4 /* PCM base */
#define LPC313X_CGU_SSR6_OFFSET          0x0a8 /* UART base */
#define LPC313X_CGU_SSR7_OFFSET          0x0ac /* CLK1024FS base */
#define LPC313X_CGU_SSR8_OFFSET          0x0b0 /* I2SRX_BCK0 base */
#define LPC313X_CGU_SSR9_OFFSET          0x0b4 /* I2SRX_BCK1 base */
#define LPC313X_CGU_SSR10_OFFSET         0x0b8 /* SPI_CLK base */
#define LPC313X_CGU_SSR11_OFFSET         0x0bc /* SYSCLK_O base */

/* Power control registers (PCR), spreading stage */

#define LPC313X_CGU_PCR_OFFSET(n)        (0x0c0+((n)<<2))
#define LPC313X_CGU_PCR0_OFFSET          0x0c0 /* APB0_CLK */
#define LPC313X_CGU_PCR1_OFFSET          0x0c4 /* APB1_CLK */
#define LPC313X_CGU_PCR2_OFFSET          0x0c8 /* APB2_CLK */
#define LPC313X_CGU_PCR3_OFFSET          0x0cc /* APB3_CLK */
#define LPC313X_CGU_PCR4_OFFSET          0x0d0 /* APB4_CLK */
#define LPC313X_CGU_PCR5_OFFSET          0x0d4 /* AHB_TO_INTC_CLK */
#define LPC313X_CGU_PCR6_OFFSET          0x0d8 /* AHB0_CLK */
#define LPC313X_CGU_PCR7_OFFSET          0x0dc /* EBI_CLK */
#define LPC313X_CGU_PCR8_OFFSET          0x0e0 /* DMA_PCLK */
#define LPC313X_CGU_PCR9_OFFSET          0x0e4 /* DMA_CLK_GATED */
#define LPC313X_CGU_PCR10_OFFSET         0x0e8 /* NANDFLASH_S0_CLK */
#define LPC313X_CGU_PCR11_OFFSET         0x0ec /* NANDFLASH_ECC_CLK */
#define LPC313X_CGU_PCR12_OFFSET         0x0f0 /* Reserved */
#define LPC313X_CGU_PCR13_OFFSET         0x0f4 /* NANDFLASH_NAND_CLK */
#define LPC313X_CGU_PCR14_OFFSET         0x0f8 /* NANDFLASH_PCLK */
#define LPC313X_CGU_PCR15_OFFSET         0x0fc /* CLOCK_OUT */
#define LPC313X_CGU_PCR16_OFFSET         0x100 /* ARM926_CORE_CLK */
#define LPC313X_CGU_PCR17_OFFSET         0x104 /* ARM926_BUSIF_CLK */
#define LPC313X_CGU_PCR18_OFFSET         0x108 /* ARM926_RETIME_CLK */
#define LPC313X_CGU_PCR19_OFFSET         0x10c /* SD_MMC_HCLK */
#define LPC313X_CGU_PCR20_OFFSET         0x110 /* SD_MMC_CCLK_IN */
#define LPC313X_CGU_PCR21_OFFSET         0x114 /* USB_OTG_AHB_CLK */
#define LPC313X_CGU_PCR22_OFFSET         0x118 /* ISRAM0_CLK */
#define LPC313X_CGU_PCR23_OFFSET         0x11c /* RED_CTL_RSCLK */
#define LPC313X_CGU_PCR24_OFFSET         0x120 /* ISRAM1_CLK (LPC313x only) */
#define LPC313X_CGU_PCR25_OFFSET         0x124 /* ISROM_CLK */
#define LPC313X_CGU_PCR26_OFFSET         0x128 /* MPMC_CFG_CLK */
#define LPC313X_CGU_PCR27_OFFSET         0x12c /* MPMC_CFG_CLK2 */
#define LPC313X_CGU_PCR28_OFFSET         0x130 /* MPMC_CFG_CLK3 */
#define LPC313X_CGU_PCR29_OFFSET         0x134 /* INTC_CLK */
#define LPC313X_CGU_PCR30_OFFSET         0x138 /* AHB_TO_APB0_PCLK */
#define LPC313X_CGU_PCR31_OFFSET         0x13c /* EVENT_ROUTER_PCLK */
#define LPC313X_CGU_PCR32_OFFSET         0x140 /* ADC_PCLK */
#define LPC313X_CGU_PCR33_OFFSET         0x144 /* ADC_CLK */
#define LPC313X_CGU_PCR34_OFFSET         0x148 /* WDOG_PCLK */
#define LPC313X_CGU_PCR35_OFFSET         0x14c /* IOCONF_PCLK */
#define LPC313X_CGU_PCR36_OFFSET         0x150 /* CGU_PCLK */
#define LPC313X_CGU_PCR37_OFFSET         0x154 /* SYSCREG_PCLK */
#define LPC313X_CGU_PCR38_OFFSET         0x158 /* Reserved */
#define LPC313X_CGU_PCR39_OFFSET         0x15c /* RNG_PCLK */
#define LPC313X_CGU_PCR40_OFFSET         0x160 /* AHB_TO_APB1_PCLK */
#define LPC313X_CGU_PCR41_OFFSET         0x164 /* TIMER0_PCLK */
#define LPC313X_CGU_PCR42_OFFSET         0x168 /* TIMER1_PCLK */
#define LPC313X_CGU_PCR43_OFFSET         0x16c /* TIMER2_PCLK */
#define LPC313X_CGU_PCR44_OFFSET         0x170 /* TIMER3_PCLK */
#define LPC313X_CGU_PCR45_OFFSET         0x174 /* PWM_PCLK */
#define LPC313X_CGU_PCR46_OFFSET         0x178 /* PWM_PCLK_REGS */
#define LPC313X_CGU_PCR47_OFFSET         0x17c /* PWM_CLK */
#define LPC313X_CGU_PCR48_OFFSET         0x180 /* I2C0_PCLK */
#define LPC313X_CGU_PCR49_OFFSET         0x184 /* I2C1_PCLK */
#define LPC313X_CGU_PCR50_OFFSET         0x188 /* AHB_TO_APB2_PCLK */
#define LPC313X_CGU_PCR51_OFFSET         0x18c /* PCM_PCLK */
#define LPC313X_CGU_PCR52_OFFSET         0x190 /* PCM_APB_PCLK */
#define LPC313X_CGU_PCR53_OFFSET         0x194 /* UART_APB_CLK */
#define LPC313X_CGU_PCR54_OFFSET         0x198 /* LCD_PCLK */
#define LPC313X_CGU_PCR55_OFFSET         0x19c /* LCD_CLK */
#define LPC313X_CGU_PCR56_OFFSET         0x1a0 /* SPI_PCLK */
#define LPC313X_CGU_PCR57_OFFSET         0x1a4 /* SPI_PCLK_GATED */
#define LPC313X_CGU_PCR58_OFFSET         0x1a8 /* AHB_TO_APB3_PCLK */
#define LPC313X_CGU_PCR59_OFFSET         0x1ac /* I2S_CFG_PCLK */
#define LPC313X_CGU_PCR60_OFFSET         0x1b0 /* EDGE_DET_PCLK */
#define LPC313X_CGU_PCR61_OFFSET         0x1b4 /* I2STX_FIFO_0_PCLK */
#define LPC313X_CGU_PCR62_OFFSET         0x1b8 /* I2STX_IF_0_PCLK */
#define LPC313X_CGU_PCR63_OFFSET         0x1bc /* I2STX_FIFO_1_PCLK */
#define LPC313X_CGU_PCR64_OFFSET         0x1c0 /* I2STX_IF_1_PCLK */
#define LPC313X_CGU_PCR65_OFFSET         0x1c4 /* I2SRX_FIFO_0_PCLK */
#define LPC313X_CGU_PCR66_OFFSET         0x1c8 /* I2SRX_IF_0_PCLK */
#define LPC313X_CGU_PCR67_OFFSET         0x1cc /* I2SRX_FIFO_1_PCLK */
#define LPC313X_CGU_PCR68_OFFSET         0x1d0 /* I2SRX_IF_1_PCLK */
#define LPC313X_CGU_PCR69_OFFSET         0x1d4 /* Reserved */
#define LPC313X_CGU_PCR70_OFFSET         0x1d8 /* Reserved */
#define LPC313X_CGU_PCR71_OFFSET         0x1dc /* PCM_CLK_IP */
#define LPC313X_CGU_PCR72_OFFSET         0x1e0 /* UART_U_CLK */
#define LPC313X_CGU_PCR73_OFFSET         0x1e4 /* I2S_EDGE_DETECT_CLK */
#define LPC313X_CGU_PCR74_OFFSET         0x1e8 /* I2STX_BCK0_N */
#define LPC313X_CGU_PCR75_OFFSET         0x1ec /* I2STX_WS0 */
#define LPC313X_CGU_PCR76_OFFSET         0x1f0 /* I2STX_CLK0 */
#define LPC313X_CGU_PCR77_OFFSET         0x1f4 /* I2STX_BCK1_N */
#define LPC313X_CGU_PCR78_OFFSET         0x1f8 /* I2STX_WS1 */
#define LPC313X_CGU_PCR79_OFFSET         0x1fc /* CLK_256FS */
#define LPC313X_CGU_PCR80_OFFSET         0x200 /* I2SRX_BCK0_N */
#define LPC313X_CGU_PCR81_OFFSET         0x204 /* I2SRX_WS0 */
#define LPC313X_CGU_PCR82_OFFSET         0x208 /* I2SRX_BCK1_N */
#define LPC313X_CGU_PCR83_OFFSET         0x20c /* I2SRX_WS1 */
#define LPC313X_CGU_PCR84_OFFSET         0x210 /* Reserved */
#define LPC313X_CGU_PCR85_OFFSET         0x214 /* Reserved */
#define LPC313X_CGU_PCR86_OFFSET         0x218 /* Reserved */
#define LPC313X_CGU_PCR87_OFFSET         0x21c /* I2SRX_BCK0 */
#define LPC313X_CGU_PCR88_OFFSET         0x220 /* I2SRX_BCK1 */
#define LPC313X_CGU_PCR89_OFFSET         0x224 /* SPI_CLK */
#define LPC313X_CGU_PCR90_OFFSET         0x228 /* SPI_CLK_GATED */
#define LPC313X_CGU_PCR91_OFFSET         0x22c /* SYSCLK_O */

/* Power status registers (PSR), spreading stage */

#define LPC313X_CGU_PSR_OFFSET(n)        (0x230+((n)<<2))
#define LPC313X_CGU_PSR0_OFFSET          0x230 /* PB0_CLK */
#define LPC313X_CGU_PSR1_OFFSET          0x234 /* PB1_CLK */
#define LPC313X_CGU_PSR2_OFFSET          0x238 /* PB2_CLK */
#define LPC313X_CGU_PSR3_OFFSET          0x23c /* PB3_CLK */
#define LPC313X_CGU_PSR4_OFFSET          0x240 /* PB4_CLK */
#define LPC313X_CGU_PSR5_OFFSET          0x244 /* HB_TO_INTC_CLK */
#define LPC313X_CGU_PSR6_OFFSET          0x248 /* HB0_CLK */
#define LPC313X_CGU_PSR7_OFFSET          0x24c /* EBI_CLK */
#define LPC313X_CGU_PSR8_OFFSET          0x250 /* DMA_PCLK */
#define LPC313X_CGU_PSR9_OFFSET          0x254 /* DMA_CLK_GATED */
#define LPC313X_CGU_PSR10_OFFSET         0x258 /* NANDFLASH_S0_CLK */
#define LPC313X_CGU_PSR11_OFFSET         0x25c /* NANDFLASH_ECC_CLK */
#define LPC313X_CGU_PSR12_OFFSET         0x260 /* Reserved */
#define LPC313X_CGU_PSR13_OFFSET         0x264 /* NANDFLASH_NAND_CLK */
#define LPC313X_CGU_PSR14_OFFSET         0x268 /* NANDFLASH_PCLK */
#define LPC313X_CGU_PSR15_OFFSET         0x26c /* CLOCK_OUT */
#define LPC313X_CGU_PSR16_OFFSET         0x270 /* RM926_CORE_CLK */
#define LPC313X_CGU_PSR17_OFFSET         0x274 /* RM926_BUSIF_CLK */
#define LPC313X_CGU_PSR18_OFFSET         0x278 /* RM926_RETIME_CLK */
#define LPC313X_CGU_PSR19_OFFSET         0x27c /* SD_MMC_HCLK */
#define LPC313X_CGU_PSR20_OFFSET         0x280 /* SD_MMC_CCLK_IN */
#define LPC313X_CGU_PSR21_OFFSET         0x284 /* USB_OTG_AHB_CLK */
#define LPC313X_CGU_PSR22_OFFSET         0x288 /* ISRAM0_CLK */
#define LPC313X_CGU_PSR23_OFFSET         0x28c /* RED_CTL_RSCLK */
#define LPC313X_CGU_PSR24_OFFSET         0x290 /* ISRAM1_CLK */
#define LPC313X_CGU_PSR25_OFFSET         0x294 /* ISROM_CLK */
#define LPC313X_CGU_PSR26_OFFSET         0x298 /* MPMC_CFG_CLK */
#define LPC313X_CGU_PSR27_OFFSET         0x29c /* MPMC_CFG_CLK2 */
#define LPC313X_CGU_PSR28_OFFSET         0x2a0 /* MPMC_CFG_CLK3 */
#define LPC313X_CGU_PSR29_OFFSET         0x2a4 /* INTC_CLK */
#define LPC313X_CGU_PSR30_OFFSET         0x2a8 /* HB_TO_APB0_PCLK */
#define LPC313X_CGU_PSR31_OFFSET         0x2ac /* EVENT_ROUTER_PCLK */
#define LPC313X_CGU_PSR32_OFFSET         0x2b0 /* DC_PCLK */
#define LPC313X_CGU_PSR33_OFFSET         0x2b4 /* DC_CLK */
#define LPC313X_CGU_PSR34_OFFSET         0x2b8 /* WDOG_PCLK */
#define LPC313X_CGU_PSR35_OFFSET         0x2bc /* IOCONF_PCLK */
#define LPC313X_CGU_PSR36_OFFSET         0x2c0 /* CGU_PCLK */
#define LPC313X_CGU_PSR37_OFFSET         0x2c4 /* SYSCREG_PCLK */
#define LPC313X_CGU_PSR38_OFFSET         0x2c8 /* Reserved */
#define LPC313X_CGU_PSR39_OFFSET         0x2cc /* RNG_PCLK */
#define LPC313X_CGU_PSR40_OFFSET         0x2d0 /* HB_TO_APB1_PCLK */
#define LPC313X_CGU_PSR41_OFFSET         0x2d4 /* TIMER0_PCLK */
#define LPC313X_CGU_PSR42_OFFSET         0x2d8 /* TIMER1_PCLK */
#define LPC313X_CGU_PSR43_OFFSET         0x2dc /* TIMER2_PCLK */
#define LPC313X_CGU_PSR44_OFFSET         0x2e0 /* TIMER3_PCLK */
#define LPC313X_CGU_PSR45_OFFSET         0x2e4 /* PWM_PCLK */
#define LPC313X_CGU_PSR46_OFFSET         0x2e8 /* PWM_PCLK_REGS */
#define LPC313X_CGU_PSR47_OFFSET         0x2ec /* PWM_CLK */
#define LPC313X_CGU_PSR48_OFFSET         0x2f0 /* I2C0_PCLK */
#define LPC313X_CGU_PSR49_OFFSET         0x2f4 /* I2C1_PCLK */
#define LPC313X_CGU_PSR50_OFFSET         0x2f8 /* HB_TO_APB2_PCLK */
#define LPC313X_CGU_PSR51_OFFSET         0x2fc /* PCM_PCLK */
#define LPC313X_CGU_PSR52_OFFSET         0x300 /* PCM_APB_PCLK */
#define LPC313X_CGU_PSR53_OFFSET         0x304 /* UART_APB_CLK */
#define LPC313X_CGU_PSR54_OFFSET         0x308 /* LCD_PCLK */
#define LPC313X_CGU_PSR55_OFFSET         0x30c /* LCD_CLK */
#define LPC313X_CGU_PSR56_OFFSET         0x310 /* SPI_PCLK */
#define LPC313X_CGU_PSR57_OFFSET         0x314 /* SPI_PCLK_GATED */
#define LPC313X_CGU_PSR58_OFFSET         0x318 /* HB_TO_APB3_PCLK */
#define LPC313X_CGU_PSR59_OFFSET         0x31c /* I2S_CFG_PCLK */
#define LPC313X_CGU_PSR60_OFFSET         0x320 /* EDGE_DET_PCLK */
#define LPC313X_CGU_PSR61_OFFSET         0x324 /* I2STX_FIFO_0_PCLK */
#define LPC313X_CGU_PSR62_OFFSET         0x328 /* I2STX_IF_0_PCLK */
#define LPC313X_CGU_PSR63_OFFSET         0x32c /* I2STX_FIFO_1_PCLK */
#define LPC313X_CGU_PSR64_OFFSET         0x330 /* I2STX_IF_1_PCLK */
#define LPC313X_CGU_PSR65_OFFSET         0x334 /* I2SRX_FIFO_0_PCLK */
#define LPC313X_CGU_PSR66_OFFSET         0x338 /* I2SRX_IF_0_PCLK */
#define LPC313X_CGU_PSR67_OFFSET         0x33c /* I2SRX_FIFO_1_PCLK */
#define LPC313X_CGU_PSR68_OFFSET         0x340 /* I2SRX_IF_1_PCLK */
#define LPC313X_CGU_PSR69_OFFSET         0x344 /* Reserved */
#define LPC313X_CGU_PSR70_OFFSET         0x348 /* Reserved */
#define LPC313X_CGU_PSR71_OFFSET         0x34c /* PCM_CLK_IP */
#define LPC313X_CGU_PSR72_OFFSET         0x350 /* UART_U_CLK */
#define LPC313X_CGU_PSR73_OFFSET         0x354 /* I2S_EDGE_DETECT_CLK */
#define LPC313X_CGU_PSR74_OFFSET         0x358 /* I2STX_BCK0_N */
#define LPC313X_CGU_PSR75_OFFSET         0x35c /* I2STX_WS0 */
#define LPC313X_CGU_PSR76_OFFSET         0x360 /* I2STX_CLK0 */
#define LPC313X_CGU_PSR77_OFFSET         0x364 /* I2STX_BCK1_N */
#define LPC313X_CGU_PSR78_OFFSET         0x368 /* I2STX_WS1 */
#define LPC313X_CGU_PSR79_OFFSET         0x36c /* CLK_256FS */
#define LPC313X_CGU_PSR80_OFFSET         0x370 /* I2SRX_BCK0_N */
#define LPC313X_CGU_PSR81_OFFSET         0x374 /* I2SRX_WS0 */
#define LPC313X_CGU_PSR82_OFFSET         0x378 /* I2SRX_BCK1_N */
#define LPC313X_CGU_PSR83_OFFSET         0x37c /* I2SRX_WS1 */
#define LPC313X_CGU_PSR84_OFFSET         0x380 /* Reserved */
#define LPC313X_CGU_PSR85_OFFSET         0x384 /* Reserved */
#define LPC313X_CGU_PSR86_OFFSET         0x388 /* Reserved */
#define LPC313X_CGU_PSR87_OFFSET         0x38c /* I2SRX_BCK0 */
#define LPC313X_CGU_PSR88_OFFSET         0x390 /* I2SRX_BCK1 */
#define LPC313X_CGU_PSR89_OFFSET         0x394 /* SPI_CLK */
#define LPC313X_CGU_PSR90_OFFSET         0x398 /* SPI_CLK_GATED */
#define LPC313X_CGU_PSR91_OFFSET         0x39c /* SYSCLK_O */

/* Enable select registers (ESR), spreading stage */

#define LPC313X_CGU_ESR_OFFSET(n)        (0x3a0+((n)<<2))
#define LPC313X_CGU_ESR0_OFFSET          0x3a0 /* APB0_CLK */
#define LPC313X_CGU_ESR1_OFFSET          0x3a4 /* APB1_CLK */
#define LPC313X_CGU_ESR2_OFFSET          0x3A8 /* APB2_CLK */
#define LPC313X_CGU_ESR3_OFFSET          0x3ac /* APB3_CLK */
#define LPC313X_CGU_ESR4_OFFSET          0x3b0 /* APB4_CLK */
#define LPC313X_CGU_ESR5_OFFSET          0x3b4 /* AHB_TO_INTC_CLK */
#define LPC313X_CGU_ESR6_OFFSET          0x3b8 /* AHB0_CLK */
#define LPC313X_CGU_ESR7_OFFSET          0x3bc /* EBI_CLK */
#define LPC313X_CGU_ESR8_OFFSET          0x3c0 /* DMA_PCLK */
#define LPC313X_CGU_ESR9_OFFSET          0x3c4 /* DMA_CLK_GATED */
#define LPC313X_CGU_ESR10_OFFSET         0x3c8 /* NANDFLASH_S0_CLK */
#define LPC313X_CGU_ESR11_OFFSET         0x3cc /* NANDFLASH_ECC_CLK */
#define LPC313X_CGU_ESR12_OFFSET         0x3d0 /* Reserved */
#define LPC313X_CGU_ESR13_OFFSET         0x3d4 /* NANDFLASH_NAND_CLK */
#define LPC313X_CGU_ESR14_OFFSET         0x3d8 /* NANDFLASH_PCLK */
#define LPC313X_CGU_ESR15_OFFSET         0x3dc /* CLOCK_OUT */
#define LPC313X_CGU_ESR16_OFFSET         0x3e0 /* ARM926_CORE_CLK */
#define LPC313X_CGU_ESR17_OFFSET         0x3e4 /* ARM926_BUSIF_CLK */
#define LPC313X_CGU_ESR18_OFFSET         0x3e8 /* ARM926_RETIME_CLK */
#define LPC313X_CGU_ESR19_OFFSET         0x3ec /* SD_MMC_HCLK */
#define LPC313X_CGU_ESR20_OFFSET         0x3f0 /* SD_MMC_CCLK_IN */
#define LPC313X_CGU_ESR21_OFFSET         0x3f4 /* USB_OTG_AHB_CLK */
#define LPC313X_CGU_ESR22_OFFSET         0x3f8 /* ISRAM0_CLK */
#define LPC313X_CGU_ESR23_OFFSET         0x3fc /* RED_CTL_RSCLK */
#define LPC313X_CGU_ESR24_OFFSET         0x400 /* ISRAM1_CLK */
#define LPC313X_CGU_ESR25_OFFSET         0x404 /* ISROM_CLK */
#define LPC313X_CGU_ESR26_OFFSET         0x408 /* MPMC_CFG_CLK */
#define LPC313X_CGU_ESR27_OFFSET         0x40c /* MPMC_CFG_CLK2 */
#define LPC313X_CGU_ESR28_OFFSET         0x410 /* MPMC_CFG_CLK3 */
#define LPC313X_CGU_ESR29_OFFSET         0x414 /* INTC_CLK */
#define LPC313X_CGU_ESR30_OFFSET         0x418 /* AHB_TO_APB0_PCLK */
#define LPC313X_CGU_ESR31_OFFSET         0x41c /* EVENT_ROUTER_PCLK */
#define LPC313X_CGU_ESR32_OFFSET         0x420 /* ADC_PCLK */
#define LPC313X_CGU_ESR33_OFFSET         0x424 /* ADC_CLK */
#define LPC313X_CGU_ESR34_OFFSET         0x428 /* WDOG_PCLK */
#define LPC313X_CGU_ESR35_OFFSET         0x42c /* IOCONF_PCLK */
#define LPC313X_CGU_ESR36_OFFSET         0x430 /* CGU_PCLK */
#define LPC313X_CGU_ESR37_OFFSET         0x434 /* SYSCREG_PCLK */
#define LPC313X_CGU_ESR38_OFFSET         0x438 /* Reserved */
#define LPC313X_CGU_ESR39_OFFSET         0x43c /* RNG_PCLK */
#define LPC313X_CGU_ESR40_OFFSET         0x440 /* AHB_TO_APB1_PCLK */
#define LPC313X_CGU_ESR41_OFFSET         0x444 /* TIMER0_PCLK */
#define LPC313X_CGU_ESR42_OFFSET         0x448 /* TIMER1_PCLK */
#define LPC313X_CGU_ESR43_OFFSET         0x44c /* TIMER2_PCLK */
#define LPC313X_CGU_ESR44_OFFSET         0x450 /* TIMER3_PCLK */
#define LPC313X_CGU_ESR45_OFFSET         0x454 /* PWM_PCLK */
#define LPC313X_CGU_ESR46_OFFSET         0x458 /* PWM_PCLK_REGS */
#define LPC313X_CGU_ESR47_OFFSET         0x45c /* PWM_CLK */
#define LPC313X_CGU_ESR48_OFFSET         0x460 /* I2C0_PCLK */
#define LPC313X_CGU_ESR49_OFFSET         0x464 /* I2C1_PCLK */
#define LPC313X_CGU_ESR50_OFFSET         0x468 /* AHB_TO_APB2_PCLK */
#define LPC313X_CGU_ESR51_OFFSET         0x46c /* PCM_PCLK */
#define LPC313X_CGU_ESR52_OFFSET         0x470 /* PCM_APB_PCLK */
#define LPC313X_CGU_ESR53_OFFSET         0x474 /* UART_APB_CLK */
#define LPC313X_CGU_ESR54_OFFSET         0x478 /* LCD_PCLK */
#define LPC313X_CGU_ESR55_OFFSET         0x47c /* LCD_CLK */
#define LPC313X_CGU_ESR56_OFFSET         0x480 /* SPI_PCLK */
#define LPC313X_CGU_ESR57_OFFSET         0x484 /* SPI_PCLK_GATED */
#define LPC313X_CGU_ESR58_OFFSET         0x488 /* AHB_TO_APB3_PCLK */
#define LPC313X_CGU_ESR59_OFFSET         0x48c /* I2S_CFG_PCLK */
#define LPC313X_CGU_ESR60_OFFSET         0x490 /* EDGE_DET_PCLK */
#define LPC313X_CGU_ESR61_OFFSET         0x494 /* I2STX_FIFO_0_PCLK */
#define LPC313X_CGU_ESR62_OFFSET         0x498 /* I2STX_IF_0_PCLK */
#define LPC313X_CGU_ESR63_OFFSET         0x49c /* I2STX_FIFO_1_PCLK */
#define LPC313X_CGU_ESR64_OFFSET         0x4a0 /* I2STX_IF_1_PCLK */
#define LPC313X_CGU_ESR65_OFFSET         0x4a4 /* I2SRX_FIFO_0_PCLK */
#define LPC313X_CGU_ESR66_OFFSET         0x4a8 /* I2SRX_IF_0_PCLK */
#define LPC313X_CGU_ESR67_OFFSET         0x4ac /* I2SRX_FIFO_1_PCLK */
#define LPC313X_CGU_ESR68_OFFSET         0x4b0 /* I2SRX_IF_1_PCLK */
#define LPC313X_CGU_ESR69_OFFSET         0x4b4 /* Reserved */
#define LPC313X_CGU_ESR70_OFFSET         0x4b8 /* Reserved */
#define LPC313X_CGU_ESR71_OFFSET         0x4bc /* PCM_CLK_IP */
#define LPC313X_CGU_ESR72_OFFSET         0x4c0 /* UART_U_CLK */
#define LPC313X_CGU_ESR73_OFFSET         0x4c4 /* I2S_EDGE_DETECT_CLK */
#define LPC313X_CGU_ESR74_OFFSET         0x4c8 /* R_I2STX_BCK0_N */
#define LPC313X_CGU_ESR75_OFFSET         0x4cc /* I2STX_WS0 */
#define LPC313X_CGU_ESR76_OFFSET         0x4d0 /* I2STX_CLK0 */
#define LPC313X_CGU_ESR77_OFFSET         0x4d4 /* I2STX_IF_BCK1_N */
#define LPC313X_CGU_ESR78_OFFSET         0x4d8 /* I2STX_WS1 */
#define LPC313X_CGU_ESR79_OFFSET         0x4dc /* CLK_256FS */
#define LPC313X_CGU_ESR80_OFFSET         0x4e0 /* I2SRX_BCK0_N */
#define LPC313X_CGU_ESR81_OFFSET         0x4e4 /* I2SRX_WS0 */
#define LPC313X_CGU_ESR82_OFFSET         0x4e8 /* I2SRX_BCK1_N */
#define LPC313X_CGU_ESR83_OFFSET         0x4ec /* I2SRX_WS1 */
#define LPC313X_CGU_ESR84_OFFSET         0x4f0 /* Reserved */
#define LPC313X_CGU_ESR85_OFFSET         0x4f4 /* Reserved */
#define LPC313X_CGU_ESR86_OFFSET         0x4f8 /* Reserved */
#define LPC313X_CGU_ESR87_OFFSET         0x4fc /* SPI_CLK */
#define LPC313X_CGU_ESR88_OFFSET         0x500 /* SPI_CLK_GATED */

/* Base control registers (BCR) for SYS base */

#define LPC313X_CGU_BCR_OFFSET(n)        (0x504+((n)<<2))
#define LPC313X_CGU_BCR0_OFFSET          0x504 /* SYS base */
#define LPC313X_CGU_BCR1_OFFSET          0x508 /* AHB0_APB0 base */
#define LPC313X_CGU_BCR2_OFFSET          0x50c /* AHB0_APB1 base */
#define LPC313X_CGU_BCR3_OFFSET          0x510 /* AHB0_APB2 base */
#define LPC313X_CGU_BCR7_OFFSET          0x514 /* CLK1024FS base */

/* Fractional divider configuration (FDC) registers */

#define LPC313X_CGU_FDC_OFFSET(n)        (0x518+((n)<<2))
#define LPC313X_CGU_FDC0_OFFSET          0x518 /* Fractional Divider 0 (SYS base) */
#define LPC313X_CGU_FDC1_OFFSET          0x51c /* Fractional Divider 1 (SYS base) */
#define LPC313X_CGU_FDC2_OFFSET          0x520 /* Fractional Divider 2 (SYS base) */
#define LPC313X_CGU_FDC3_OFFSET          0x524 /* Fractional Divider 3 (SYS base) */
#define LPC313X_CGU_FDC4_OFFSET          0x528 /* Fractional Divider 4 (SYS base) */
#define LPC313X_CGU_FDC5_OFFSET          0x52c /* Fractional Divider 5 (SYS base) */
#define LPC313X_CGU_FDC6_OFFSET          0x530 /* Fractional Divider 6 (SYS base) */
#define LPC313X_CGU_FDC7_OFFSET          0x534 /* Fractional Divider 7 (AHB0_APB0 base) */
#define LPC313X_CGU_FDC8_OFFSET          0x538 /* Fractional Divider 8 (AHB0_APB0 base) */
#define LPC313X_CGU_FDC9_OFFSET          0x53c /* Fractional Divider 9 (AHB0_APB1 base) */
#define LPC313X_CGU_FDC10_OFFSET         0x540 /* Fractional Divider 10 (AHB0_APB1 base) */
#define LPC313X_CGU_FDC11_OFFSET         0x544 /* Fractional Divider 11 (AHB0_APB2 base) */
#define LPC313X_CGU_FDC12_OFFSET         0x548 /* Fractional Divider 12 (AHB0_APB2 base) */
#define LPC313X_CGU_FDC13_OFFSET         0x54c /* Fractional Divider 13 (AHB0_APB2 base) */
#define LPC313X_CGU_FDC14_OFFSET         0x550 /* Fractional Divider 14 (AHB0_APB3 base) */
#define LPC313X_CGU_FDC15_OFFSET         0x554 /* Fractional Divider 15 (PCM base) */
#define LPC313X_CGU_FDC16_OFFSET         0x558 /* Fractional Divider 16 (UART base) */
#define LPC313X_CGU_FDC17_OFFSET         0x55c /* Fractional Divider 17 (CLK1024FS base) */
#define LPC313X_CGU_FDC18_OFFSET         0x560 /* Fractional Divider 18 (CLK1024FS base) */
#define LPC313X_CGU_FDC19_OFFSET         0x564 /* Fractional Divider 19 (CLK1024FS base) */
#define LPC313X_CGU_FDC20_OFFSET         0x568 /* Fractional Divider 20 (CLK1024FS base) */
#define LPC313X_CGU_FDC21_OFFSET         0x56c /* Fractional Divider 21 (CLK1024FS base) */
#define LPC313X_CGU_FDC22_OFFSET         0x570 /* Fractional Divider 22 (CLK1024FS base) */
#define LPC313X_CGU_FDC23_OFFSET         0x574 /* Fractional Divider 23 (SPI_CLK base) */

/* Dynamic fractional divider configuration (DYNFDC) registers (SYS base only) */

#define LPC313X_CGU_DYNFDC_OFFSET(n)     (0x578+((n)<<2))
#define LPC313X_CGU_DYNFDC0_OFFSET       0x578 /* Fractional Divider 0 (SYS base) */
#define LPC313X_CGU_DYNFDC1_OFFSET       0x57c /* Fractional Divider 1 (SYS base) */
#define LPC313X_CGU_DYNFDC2_OFFSET       0x580 /* Fractional Divider 2 (SYS base) */
#define LPC313X_CGU_DYNFDC3_OFFSET       0x584 /* Fractional Divider 3 (SYS base) */
#define LPC313X_CGU_DYNFDC4_OFFSET       0x588 /* Fractional Divider 4 (SYS base) */
#define LPC313X_CGU_DYNFDC5_OFFSET       0x58c /* Fractional Divider 5 (SYS base) */
#define LPC313X_CGU_DYNFDC6_OFFSET       0x590 /* Fractional Divider 6 (SYS base) */

