apache/nuttx/arch/arm/src/lpc313x/lpc313x_cgu.h
/* HP1 PLL control (system PLL) */

#define LPC313X_CGU_HP1FINSEL_OFFSET     0x128 /* Register for selecting input to high HP1 PLL */
#define LPC313X_CGU_HP1MDEC_OFFSET       0x12c /* M-divider register of HP1 PLL */
#define LPC313X_CGU_HP1NDEC_OFFSET       0x130 /* N-divider register of HP1 PLL */
#define LPC313X_CGU_HP1PDEC_OFFSET       0x134 /* P-divider register of HP1 PLL */
#define LPC313X_CGU_HP1MODE_OFFSET       0x138 /* Mode register of HP1 PLL */
#define LPC313X_CGU_HP1STATUS_OFFSET     0x13c /* Status register of HP1 PLL */
#define LPC313X_CGU_HP1ACK_OFFSET        0x140 /* Ratio change acknowledge register of HP1 PLL */
#define LPC313X_CGU_HP1REQ_OFFSET        0x144 /* Ratio change request register of HP1 PLL */
#define LPC313X_CGU_HP1INSELR_OFFSET     0x148 /* Bandwidth selection register of HP1 PLL */
#define LPC313X_CGU_HP1INSELI_OFFSET     0x14c /* Bandwidth selection register of HP1 PLL */
#define LPC313X_CGU_HP1INSELP_OFFSET     0x150 /* Bandwidth selection register of HP1 PLL */
#define LPC313X_CGU_HP1SELR_OFFSET       0x154 /* Bandwidth selection register of HP1 PLL */
#define LPC313X_CGU_HP1SELI_OFFSET       0x158 /* Bandwidth selection register of HP1 PLL */
#define LPC313X_CGU_HP1SELP_OFFSET       0x15c /* Bandwidth selection register of HP1 PLL */

/* CGU register (virtual) addresses *************************************************************/
/* CGU clock switchbox (virtual) register addresses *********************************************/
/* Switch configuration registers (SCR) for base clocks */

#define LPC313X_CGU_SCR(n)               (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SCR_OFFSET(n))
#define LPC313X_CGU_SCR0                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SCR0_OFFSET)
#define LPC313X_CGU_SCR1                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SCR1_OFFSET)
#define LPC313X_CGU_SCR2                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SCR2_OFFSET)
#define LPC313X_CGU_SCR3                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SCR3_OFFSET)
#define LPC313X_CGU_SCR4                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SCR4_OFFSET)
#define LPC313X_CGU_SCR5                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SCR5_OFFSET)
#define LPC313X_CGU_SCR6                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SCR6_OFFSET)
#define LPC313X_CGU_SCR7                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SCR7_OFFSET)
#define LPC313X_CGU_SCR8                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SCR8_OFFSET)
#define LPC313X_CGU_SCR9                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SCR9_OFFSET)
#define LPC313X_CGU_SCR10                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SCR10_OFFSET)
#define LPC313X_CGU_SCR11                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SCR11_OFFSET)

/* Frequency select (FS) registers 1 for base clocks */

#define LPC313X_CGU_FS1(n)               (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS1_OFFSET(n))
#define LPC313X_CGU_FS1_0                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS1_0_OFFSET)
#define LPC313X_CGU_FS1_1                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS1_1_OFFSET)
#define LPC313X_CGU_FS1_2                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS1_2_OFFSET)
#define LPC313X_CGU_FS1_3                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS1_3_OFFSET)
#define LPC313X_CGU_FS1_4                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS1_4_OFFSET)
#define LPC313X_CGU_FS1_5                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS1_5_OFFSET)
#define LPC313X_CGU_FS1_6                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS1_6_OFFSET)
#define LPC313X_CGU_FS1_7                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS1_7_OFFSET)
#define LPC313X_CGU_FS1_8                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS1_8_OFFSET)
#define LPC313X_CGU_FS1_9                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS1_9_OFFSET)
#define LPC313X_CGU_FS1_10               (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS1_10_OFFSET)
#define LPC313X_CGU_FS1_11               (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS1_11_OFFSET)

/* Frequency select (FS) registers 2 for base clocks */

#define LPC313X_CGU_FS2(n)               (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS2_OFFSET(n))
#define LPC313X_CGU_FS2_0                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS2_0_OFFSET)
#define LPC313X_CGU_FS2_1                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS2_1_OFFSET)
#define LPC313X_CGU_FS2_2                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS2_2_OFFSET)
#define LPC313X_CGU_FS2_3                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS2_3_OFFSET)
#define LPC313X_CGU_FS2_4                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS2_4_OFFSET)
#define LPC313X_CGU_FS2_5                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS2_5_OFFSET)
#define LPC313X_CGU_FS2_6                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS2_6_OFFSET)
#define LPC313X_CGU_FS2_7                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS2_7_OFFSET)
#define LPC313X_CGU_FS2_8                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS2_8_OFFSET)
#define LPC313X_CGU_FS2_9                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS2_9_OFFSET)
#define LPC313X_CGU_FS2_10               (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS2_10_OFFSET)
#define LPC313X_CGU_FS2_11               (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_FS2_11_OFFSET)

/* Switch status registers (SSR) for base clocks */

#define LPC313X_CGU_SSR(n)               (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SSR_OFFSET(n))
#define LPC313X_CGU_SSR0                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SSR0_OFFSET)
#define LPC313X_CGU_SSR1                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SSR1_OFFSET)
#define LPC313X_CGU_SSR2                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SSR2_OFFSET)
#define LPC313X_CGU_SSR3                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SSR3_OFFSET)
#define LPC313X_CGU_SSR4                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SSR4_OFFSET)
#define LPC313X_CGU_SSR5                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SSR5_OFFSET)
#define LPC313X_CGU_SSR6                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SSR6_OFFSET)
#define LPC313X_CGU_SSR7                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SSR7_OFFSET)
#define LPC313X_CGU_SSR8                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SSR8_OFFSET)
#define LPC313X_CGU_SSR9                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SSR9_OFFSET)
#define LPC313X_CGU_SSR10                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SSR10_OFFSET)
#define LPC313X_CGU_SSR11                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_SSR11_OFFSET)

/* Power control registers (PCR), spreading stage */

