apache/nuttx/arch/arm/src/lpc313x/lpc313x_cgu.h
#define LPC313X_CGU_PCR(n)               (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR_OFFSET(n))
#define LPC313X_CGU_PCR0                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR0_OFFSET)
#define LPC313X_CGU_PCR1                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR1_OFFSET)
#define LPC313X_CGU_PCR2                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR2_OFFSET)
#define LPC313X_CGU_PCR3                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR3_OFFSET)
#define LPC313X_CGU_PCR4                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR4_OFFSET)
#define LPC313X_CGU_PCR5                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR5_OFFSET)
#define LPC313X_CGU_PCR6                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR6_OFFSET)
#define LPC313X_CGU_PCR7                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR7_OFFSET)
#define LPC313X_CGU_PCR8                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR8_OFFSET)
#define LPC313X_CGU_PCR9                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR9_OFFSET)
#define LPC313X_CGU_PCR10                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR10_OFFSET)
#define LPC313X_CGU_PCR11                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR11_OFFSET)
#define LPC313X_CGU_PCR12                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR12_OFFSET)
#define LPC313X_CGU_PCR13                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR13_OFFSET)
#define LPC313X_CGU_PCR14                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR14_OFFSET)
#define LPC313X_CGU_PCR15                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR15_OFFSET)
#define LPC313X_CGU_PCR16                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR16_OFFSET)
#define LPC313X_CGU_PCR17                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR17_OFFSET)
#define LPC313X_CGU_PCR18                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR18_OFFSET)
#define LPC313X_CGU_PCR19                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR19_OFFSET)
#define LPC313X_CGU_PCR20                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR20_OFFSET)
#define LPC313X_CGU_PCR21                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR21_OFFSET)
#define LPC313X_CGU_PCR22                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR22_OFFSET)
#define LPC313X_CGU_PCR23                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR23_OFFSET)
#define LPC313X_CGU_PCR24                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR24_OFFSET)
#define LPC313X_CGU_PCR25                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR25_OFFSET)
#define LPC313X_CGU_PCR26                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR26_OFFSET)
#define LPC313X_CGU_PCR27                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR27_OFFSET)
#define LPC313X_CGU_PCR28                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR28_OFFSET)
#define LPC313X_CGU_PCR29                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR29_OFFSET)
#define LPC313X_CGU_PCR30                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR30_OFFSET)
#define LPC313X_CGU_PCR31                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR31_OFFSET)
#define LPC313X_CGU_PCR32                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR32_OFFSET)
#define LPC313X_CGU_PCR33                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR33_OFFSET)
#define LPC313X_CGU_PCR34                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR34_OFFSET)
#define LPC313X_CGU_PCR35                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR35_OFFSET)
#define LPC313X_CGU_PCR36                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR36_OFFSET)
#define LPC313X_CGU_PCR37                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR37_OFFSET)
#define LPC313X_CGU_PCR38                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR38_OFFSET)
#define LPC313X_CGU_PCR39                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR39_OFFSET)
#define LPC313X_CGU_PCR40                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR40_OFFSET)
#define LPC313X_CGU_PCR41                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR41_OFFSET)
#define LPC313X_CGU_PCR42                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR42_OFFSET)
#define LPC313X_CGU_PCR43                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR43_OFFSET)
#define LPC313X_CGU_PCR44                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR44_OFFSET)
#define LPC313X_CGU_PCR45                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR45_OFFSET)
#define LPC313X_CGU_PCR46                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR46_OFFSET)
#define LPC313X_CGU_PCR47                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR47_OFFSET)
#define LPC313X_CGU_PCR48                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR48_OFFSET)
#define LPC313X_CGU_PCR49                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR49_OFFSET)
#define LPC313X_CGU_PCR50                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR50_OFFSET)
#define LPC313X_CGU_PCR51                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR51_OFFSET)
#define LPC313X_CGU_PCR52                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR52_OFFSET)
#define LPC313X_CGU_PCR53                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR53_OFFSET)
#define LPC313X_CGU_PCR54                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR54_OFFSET)
#define LPC313X_CGU_PCR55                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR55_OFFSET)
#define LPC313X_CGU_PCR56                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR56_OFFSET)
#define LPC313X_CGU_PCR57                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR57_OFFSET)
#define LPC313X_CGU_PCR58                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR58_OFFSET)
#define LPC313X_CGU_PCR59                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR59_OFFSET)
#define LPC313X_CGU_PCR60                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR60_OFFSET)
#define LPC313X_CGU_PCR61                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR61_OFFSET)
#define LPC313X_CGU_PCR62                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR62_OFFSET)
#define LPC313X_CGU_PCR63                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR63_OFFSET)
#define LPC313X_CGU_PCR64                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR64_OFFSET)
#define LPC313X_CGU_PCR65                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR65_OFFSET)
#define LPC313X_CGU_PCR66                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR66_OFFSET)
#define LPC313X_CGU_PCR67                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR67_OFFSET)
#define LPC313X_CGU_PCR68                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR68_OFFSET)
#define LPC313X_CGU_PCR69                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR69_OFFSET)
#define LPC313X_CGU_PCR70                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR70_OFFSET)
#define LPC313X_CGU_PCR71                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR71_OFFSET)
#define LPC313X_CGU_PCR72                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR72_OFFSET)
#define LPC313X_CGU_PCR73                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR73_OFFSET)
#define LPC313X_CGU_PCR74                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR74_OFFSET)
#define LPC313X_CGU_PCR75                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR75_OFFSET)
#define LPC313X_CGU_PCR76                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR76_OFFSET)
#define LPC313X_CGU_PCR77                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR77_OFFSET)
#define LPC313X_CGU_PCR78                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR78_OFFSET)
#define LPC313X_CGU_PCR79                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR79_OFFSET)
#define LPC313X_CGU_PCR80                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR80_OFFSET)
#define LPC313X_CGU_PCR81                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR81_OFFSET)
#define LPC313X_CGU_PCR82                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR82_OFFSET)
#define LPC313X_CGU_PCR83                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR83_OFFSET)
#define LPC313X_CGU_PCR84                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR84_OFFSET)
#define LPC313X_CGU_PCR85                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR85_OFFSET)
#define LPC313X_CGU_PCR86                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR86_OFFSET)
#define LPC313X_CGU_PCR87                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR87_OFFSET)
#define LPC313X_CGU_PCR88                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR88_OFFSET)
#define LPC313X_CGU_PCR89                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR89_OFFSET)
#define LPC313X_CGU_PCR90                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR90_OFFSET)
#define LPC313X_CGU_PCR91                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PCR91_OFFSET)

/* Power status registers (PSR), spreading stage */

