apache/nuttx/arch/arm/src/lpc313x/lpc313x_cgu.h
#define LPC313X_CGU_PSR(n)               (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR_OFFSET(n))
#define LPC313X_CGU_PSR0                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR0_OFFSET)
#define LPC313X_CGU_PSR1                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR1_OFFSET)
#define LPC313X_CGU_PSR2                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR2_OFFSET)
#define LPC313X_CGU_PSR3                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR3_OFFSET)
#define LPC313X_CGU_PSR4                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR4_OFFSET)
#define LPC313X_CGU_PSR5                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR5_OFFSET)
#define LPC313X_CGU_PSR6                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR6_OFFSET)
#define LPC313X_CGU_PSR7                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR7_OFFSET)
#define LPC313X_CGU_PSR8                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR8_OFFSET)
#define LPC313X_CGU_PSR9                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR9_OFFSET)
#define LPC313X_CGU_PSR10                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR10_OFFSET)
#define LPC313X_CGU_PSR11                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR11_OFFSET)
#define LPC313X_CGU_PSR12                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR12_OFFSET)
#define LPC313X_CGU_PSR13                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR13_OFFSET)
#define LPC313X_CGU_PSR14                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR14_OFFSET)
#define LPC313X_CGU_PSR15                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR15_OFFSET)
#define LPC313X_CGU_PSR16                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR16_OFFSET)
#define LPC313X_CGU_PSR17                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR17_OFFSET)
#define LPC313X_CGU_PSR18                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR18_OFFSET)
#define LPC313X_CGU_PSR19                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR19_OFFSET)
#define LPC313X_CGU_PSR20                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR20_OFFSET)
#define LPC313X_CGU_PSR21                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR21_OFFSET)
#define LPC313X_CGU_PSR22                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR22_OFFSET)
#define LPC313X_CGU_PSR23                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR23_OFFSET)
#define LPC313X_CGU_PSR24                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR24_OFFSET)
#define LPC313X_CGU_PSR25                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR25_OFFSET)
#define LPC313X_CGU_PSR26                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR26_OFFSET)
#define LPC313X_CGU_PSR27                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR27_OFFSET)
#define LPC313X_CGU_PSR28                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR28_OFFSET)
#define LPC313X_CGU_PSR29                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR29_OFFSET)
#define LPC313X_CGU_PSR30                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR30_OFFSET)
#define LPC313X_CGU_PSR31                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR31_OFFSET)
#define LPC313X_CGU_PSR32                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR32_OFFSET)
#define LPC313X_CGU_PSR33                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR33_OFFSET)
#define LPC313X_CGU_PSR34                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR34_OFFSET)
#define LPC313X_CGU_PSR35                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR35_OFFSET)
#define LPC313X_CGU_PSR36                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR36_OFFSET)
#define LPC313X_CGU_PSR37                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR37_OFFSET)
#define LPC313X_CGU_PSR38                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR38_OFFSET)
#define LPC313X_CGU_PSR39                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR39_OFFSET)
#define LPC313X_CGU_PSR40                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR40_OFFSET)
#define LPC313X_CGU_PSR41                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR41_OFFSET)
#define LPC313X_CGU_PSR42                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR42_OFFSET)
#define LPC313X_CGU_PSR43                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR43_OFFSET)
#define LPC313X_CGU_PSR44                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR44_OFFSET)
#define LPC313X_CGU_PSR45                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR45_OFFSET)
#define LPC313X_CGU_PSR46                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR46_OFFSET)
#define LPC313X_CGU_PSR47                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR47_OFFSET)
#define LPC313X_CGU_PSR48                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR48_OFFSET)
#define LPC313X_CGU_PSR49                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR49_OFFSET)
#define LPC313X_CGU_PSR50                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR50_OFFSET)
#define LPC313X_CGU_PSR51                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR51_OFFSET)
#define LPC313X_CGU_PSR52                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR52_OFFSET)
#define LPC313X_CGU_PSR53                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR53_OFFSET)
#define LPC313X_CGU_PSR54                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR54_OFFSET)
#define LPC313X_CGU_PSR55                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR55_OFFSET)
#define LPC313X_CGU_PSR56                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR56_OFFSET)
#define LPC313X_CGU_PSR57                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR57_OFFSET)
#define LPC313X_CGU_PSR58                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR58_OFFSET)
#define LPC313X_CGU_PSR59                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR59_OFFSET)
#define LPC313X_CGU_PSR60                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR60_OFFSET)
#define LPC313X_CGU_PSR61                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR61_OFFSET)
#define LPC313X_CGU_PSR62                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR62_OFFSET)
#define LPC313X_CGU_PSR63                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR63_OFFSET)
#define LPC313X_CGU_PSR64                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR64_OFFSET)
#define LPC313X_CGU_PSR65                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR65_OFFSET)
#define LPC313X_CGU_PSR66                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR66_OFFSET)
#define LPC313X_CGU_PSR67                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR67_OFFSET)
#define LPC313X_CGU_PSR68                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR68_OFFSET)
#define LPC313X_CGU_PSR69                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR69_OFFSET)
#define LPC313X_CGU_PSR70                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR70_OFFSET)
#define LPC313X_CGU_PSR71                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR71_OFFSET)
#define LPC313X_CGU_PSR72                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR72_OFFSET)
#define LPC313X_CGU_PSR73                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR73_OFFSET)
#define LPC313X_CGU_PSR74                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR74_OFFSET)
#define LPC313X_CGU_PSR75                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR75_OFFSET)
#define LPC313X_CGU_PSR76                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR76_OFFSET)
#define LPC313X_CGU_PSR77                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR77_OFFSET)
#define LPC313X_CGU_PSR78                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR78_OFFSET)
#define LPC313X_CGU_PSR79                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR79_OFFSET)
#define LPC313X_CGU_PSR80                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR80_OFFSET)
#define LPC313X_CGU_PSR81                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR81_OFFSET)
#define LPC313X_CGU_PSR82                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR82_OFFSET)
#define LPC313X_CGU_PSR83                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR83_OFFSET)
#define LPC313X_CGU_PSR84                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR84_OFFSET)
#define LPC313X_CGU_PSR85                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR85_OFFSET)
#define LPC313X_CGU_PSR86                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR86_OFFSET)
#define LPC313X_CGU_PSR87                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR87_OFFSET)
#define LPC313X_CGU_PSR88                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR88_OFFSET)
#define LPC313X_CGU_PSR89                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR89_OFFSET)
#define LPC313X_CGU_PSR90                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR90_OFFSET)
#define LPC313X_CGU_PSR91                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_PSR91_OFFSET)

/* Enable select registers (ESR), spreading stage */

