apache/nuttx/arch/arm/src/lpc313x/lpc313x_cgu.h
#define LPC313X_CGU_ESR(n)               (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR_OFFSET(n))
#define LPC313X_CGU_ESR0                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR0_OFFSET)
#define LPC313X_CGU_ESR1                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR1_OFFSET)
#define LPC313X_CGU_ESR2                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR2_OFFSET)
#define LPC313X_CGU_ESR3                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR3_OFFSET)
#define LPC313X_CGU_ESR4                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR4_OFFSET)
#define LPC313X_CGU_ESR5                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR5_OFFSET)
#define LPC313X_CGU_ESR6                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR6_OFFSET)
#define LPC313X_CGU_ESR7                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR7_OFFSET)
#define LPC313X_CGU_ESR8                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR8_OFFSET)
#define LPC313X_CGU_ESR9                 (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR9_OFFSET)
#define LPC313X_CGU_ESR10                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR10_OFFSET)
#define LPC313X_CGU_ESR11                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR11_OFFSET)
#define LPC313X_CGU_ESR12                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR12_OFFSET)
#define LPC313X_CGU_ESR13                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR13_OFFSET)
#define LPC313X_CGU_ESR14                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR14_OFFSET)
#define LPC313X_CGU_ESR15                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR15_OFFSET)
#define LPC313X_CGU_ESR16                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR16_OFFSET)
#define LPC313X_CGU_ESR17                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR17_OFFSET)
#define LPC313X_CGU_ESR18                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR18_OFFSET)
#define LPC313X_CGU_ESR19                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR19_OFFSET)
#define LPC313X_CGU_ESR20                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR20_OFFSET)
#define LPC313X_CGU_ESR21                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR21_OFFSET)
#define LPC313X_CGU_ESR22                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR22_OFFSET)
#define LPC313X_CGU_ESR23                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR23_OFFSET)
#define LPC313X_CGU_ESR24                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR24_OFFSET)
#define LPC313X_CGU_ESR25                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR25_OFFSET)
#define LPC313X_CGU_ESR26                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR26_OFFSET)
#define LPC313X_CGU_ESR27                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR27_OFFSET)
#define LPC313X_CGU_ESR28                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR28_OFFSET)
#define LPC313X_CGU_ESR29                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR29_OFFSET)
#define LPC313X_CGU_ESR30                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR30_OFFSET)
#define LPC313X_CGU_ESR31                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR31_OFFSET)
#define LPC313X_CGU_ESR32                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR32_OFFSET)
#define LPC313X_CGU_ESR33                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR33_OFFSET)
#define LPC313X_CGU_ESR34                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR34_OFFSET)
#define LPC313X_CGU_ESR35                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR35_OFFSET)
#define LPC313X_CGU_ESR36                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR36_OFFSET)
#define LPC313X_CGU_ESR37                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR37_OFFSET)
#define LPC313X_CGU_ESR38                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR38_OFFSET)
#define LPC313X_CGU_ESR39                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR39_OFFSET)
#define LPC313X_CGU_ESR40                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR40_OFFSET)
#define LPC313X_CGU_ESR41                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR41_OFFSET)
#define LPC313X_CGU_ESR42                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR42_OFFSET)
#define LPC313X_CGU_ESR43                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR43_OFFSET)
#define LPC313X_CGU_ESR44                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR44_OFFSET)
#define LPC313X_CGU_ESR45                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR45_OFFSET)
#define LPC313X_CGU_ESR46                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR46_OFFSET)
#define LPC313X_CGU_ESR47                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR47_OFFSET)
#define LPC313X_CGU_ESR48                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR48_OFFSET)
#define LPC313X_CGU_ESR49                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR49_OFFSET)
#define LPC313X_CGU_ESR50                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR50_OFFSET)
#define LPC313X_CGU_ESR51                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR51_OFFSET)
#define LPC313X_CGU_ESR52                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR52_OFFSET)
#define LPC313X_CGU_ESR53                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR53_OFFSET)
#define LPC313X_CGU_ESR54                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR54_OFFSET)
#define LPC313X_CGU_ESR55                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR55_OFFSET)
#define LPC313X_CGU_ESR56                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR56_OFFSET)
#define LPC313X_CGU_ESR57                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR57_OFFSET)
#define LPC313X_CGU_ESR58                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR58_OFFSET)
#define LPC313X_CGU_ESR59                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR59_OFFSET)
#define LPC313X_CGU_ESR60                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR60_OFFSET)
#define LPC313X_CGU_ESR61                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR61_OFFSET)
#define LPC313X_CGU_ESR62                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR62_OFFSET)
#define LPC313X_CGU_ESR63                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR63_OFFSET)
#define LPC313X_CGU_ESR64                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR64_OFFSET)
#define LPC313X_CGU_ESR65                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR65_OFFSET)
#define LPC313X_CGU_ESR66                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR66_OFFSET)
#define LPC313X_CGU_ESR67                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR67_OFFSET)
#define LPC313X_CGU_ESR68                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR68_OFFSET)
#define LPC313X_CGU_ESR69                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR69_OFFSET)
#define LPC313X_CGU_ESR70                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR70_OFFSET)
#define LPC313X_CGU_ESR71                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR71_OFFSET)
#define LPC313X_CGU_ESR72                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR72_OFFSET)
#define LPC313X_CGU_ESR73                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR73_OFFSET)
#define LPC313X_CGU_ESR74                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR74_OFFSET)
#define LPC313X_CGU_ESR75                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR75_OFFSET)
#define LPC313X_CGU_ESR76                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR76_OFFSET)
#define LPC313X_CGU_ESR77                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR77_OFFSET)
#define LPC313X_CGU_ESR78                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR78_OFFSET)
#define LPC313X_CGU_ESR79                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR79_OFFSET)
#define LPC313X_CGU_ESR80                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR80_OFFSET)
#define LPC313X_CGU_ESR81                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR81_OFFSET)
#define LPC313X_CGU_ESR82                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR82_OFFSET)
#define LPC313X_CGU_ESR83                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR83_OFFSET)
#define LPC313X_CGU_ESR84                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR84_OFFSET)
#define LPC313X_CGU_ESR85                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR85_OFFSET)
#define LPC313X_CGU_ESR86                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR86_OFFSET)
#define LPC313X_CGU_ESR87                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR87_OFFSET)
#define LPC313X_CGU_ESR88                (LPC313X_CGU_CSB_VBASE+LPC313X_CGU_ESR88_OFFSET)

/* Base control registers (BCR) for SYS base */

